TexasInstruments/motor-control-sdk/examples/tidep_01032_dual_motor_drive/single_chip_servo/am243x-lp/r5fss0-0_nortos/example.syscfg
mpu_armv77.$name        = "CONFIG_MPU_REGION6_ICSSG0";
mpu_armv77.baseAddr     = 0x30000000;
mpu_armv77.size         = 19;
mpu_armv77.allowExecute = false;
mpu_armv77.attributes   = "NonCached";

mpu_armv78.$name        = "CONFIG_MPU_REGION7_PWMs0_8";
mpu_armv78.baseAddr     = 0x23000000;
mpu_armv78.size         = 19;
mpu_armv78.attributes   = "NonCached";
mpu_armv78.allowExecute = false;

mpu_armv79.$name      = "CONFIG_MPU_REGION8_PWM9";
mpu_armv79.attributes = "NonCached";
mpu_armv79.size       = 16;
mpu_armv79.baseAddr   = 0x23080000;

mpu_armv710.$name        = "CONFIG_MPU_REGION9_OTHER_R5F_TCMB";
mpu_armv710.baseAddr     = 0x78500000;
mpu_armv710.size         = 15;
mpu_armv710.allowExecute = false;
mpu_armv710.attributes   = "NonCached";

mpu_armv711.$name        = "CONFIG_MPU_MSRAM_CTRLVARS";
mpu_armv711.baseAddr     = 0x701BFF00;
mpu_armv711.size         = 8;
mpu_armv711.allowExecute = false;

mpu_armv712.$name        = "CONFIG_MPU_MSRAM_NOCACHE";
mpu_armv712.size         = 16;
mpu_armv712.attributes   = "NonCached";
mpu_armv712.allowExecute = false;
mpu_armv712.baseAddr     = 0x701D0000;

mpu_armv713.$name        = "CONFIG_MPU_MSRAM_NOCACHE0";
mpu_armv713.baseAddr     = 0x701C0000;
mpu_armv713.size         = 16;
mpu_armv713.attributes   = "NonCached";
mpu_armv713.allowExecute = false;

default_linker1.$name = "memory_configurator_default_linker0";

general1.$name          = "CONFIG_GENERAL0";
general1.irq_stack_size = 8192;
general1.svc_stack_size = 8192;
general1.linker.$name   = "TIARMCLANG0";

region1.$name                                = "MEMORY_REGION_CONFIGURATION0";
region1.memory_region.create(15);
region1.memory_region[0].type                = "TCMA_R5F";
region1.memory_region[0].$name               = "R5F_VECS";
region1.memory_region[0].size                = 0x40;
region1.memory_region[0].auto                = false;
region1.memory_region[1].type                = "TCMA_R5F";
region1.memory_region[1].$name               = "R5F_TCMA";
region1.memory_region[1].size                = 0x7FC0;
region1.memory_region[1].auto                = false;
region1.memory_region[1].manualStartAddress  = 0x40;
region1.memory_region[2].type                = "TCMB_R5F";
region1.memory_region[2].$name               = "R5F_TCMB0_SDDF_0_0";
region1.memory_region[2].size                = 0x80;
region1.memory_region[2].auto                = false;
region1.memory_region[3].type                = "TCMB_R5F";
region1.memory_region[3].size                = 0x100;
region1.memory_region[3].auto                = false;
region1.memory_region[3].manualStartAddress  = 0x41010100;
region1.memory_region[3].$name               = "R5F_TCMB0_ENC_0_0";
region1.memory_region[4].type                = "TCMB_R5F";
region1.memory_region[4].$name               = "R5F_TCMB0_PDO";
region1.memory_region[4].size                = 0x100;
region1.memory_region[4].auto                = false;
region1.memory_region[4].manualStartAddress  = 0x41010200;
region1.memory_region[5].type                = "TCMB_R5F";
region1.memory_region[5].$name               = "R5F_TCMB0";
region1.memory_region[5].size                = 0x7D00;
region1.memory_region[5].auto                = false;
region1.memory_region[5].manualStartAddress  = 0x41010300;
region1.memory_region[6].$name               = "MSRAM1";
region1.memory_region[6].auto                = false;
region1.memory_region[6].manualStartAddress  = 0x70040000;
region1.memory_region[6].size                = 0x40000;
region1.memory_region[6].isShared            = true;
region1.memory_region[6].shared_cores        = ["r5fss0-1"];
region1.memory_region[7].$name               = "MSRAM2";
region1.memory_region[7].auto                = false;
region1.memory_region[7].manualStartAddress  = 0x70080000;
region1.memory_region[7].size                = 0x40000;
region1.memory_region[7].isShared            = true;
region1.memory_region[7].shared_cores        = ["r5fss0-1"];
region1.memory_region[8].$name               = "MSRAM_0_0";
region1.memory_region[8].auto                = false;
region1.memory_region[8].manualStartAddress  = 0x70140000;
region1.memory_region[8].size                = 0x40000;
region1.memory_region[9].$name               = "MSRAM_CTRL_VARS_0_0";
region1.memory_region[9].auto                = false;
region1.memory_region[9].manualStartAddress  = 0x701BFE00;
region1.memory_region[9].size                = 0x100;
region1.memory_region[10].$name              = "MSRAM_NO_CACHE";
region1.memory_region[10].auto               = false;
region1.memory_region[10].manualStartAddress = 0x701C0000;
region1.memory_region[10].size               = 0x100;
region1.memory_region[10].isShared           = true;
region1.memory_region[10].shared_cores       = ["r5fss0-1","r5fss1-0"];
region1.memory_region[11].$name              = "USER_SHM_MEM";
region1.memory_region[11].auto               = false;
region1.memory_region[11].manualStartAddress = 0x701D0000;
region1.memory_region[11].size               = 0x4000;
region1.memory_region[11].isShared           = true;
region1.memory_region[11].shared_cores       = ["r5fss0-1","r5fss1-0"];
region1.memory_region[12].$name              = "LOG_SHM_MEM";
region1.memory_region[12].auto               = false;
region1.memory_region[12].manualStartAddress = 0x701D4000;
region1.memory_region[12].size               = 0x4000;
region1.memory_region[12].isShared           = true;
region1.memory_region[12].shared_cores       = ["r5fss0-1","r5fss1-0"];
region1.memory_region[13].$name              = "RTOS_NORTOS_IPC_SHM_MEM";
region1.memory_region[13].auto               = false;
region1.memory_region[13].manualStartAddress = 0x701D8000;
region1.memory_region[13].size               = 0x8000;
region1.memory_region[13].isShared           = true;
region1.memory_region[13].shared_cores       = ["r5fss0-1","r5fss1-0"];
region1.memory_region[14].type               = "CUSTOM_ALL";
region1.memory_region[14].$name              = "OTHER_R5F_TCMB0_PDO";
region1.memory_region[14].auto               = false;
region1.memory_region[14].manualStartAddress = 0x78500000;
region1.memory_region[14].size               = 0x100;
region1.memory_region[14].isShared           = true;
region1.memory_region[14].shared_cores       = ["r5fss0-1"];

section1.$name                        = "Vector Table";
section1.load_memory                  = "R5F_VECS";
section1.group                        = false;
section1.output_section.create(1);
section1.output_section[0].$name      = ".vectors";
section1.output_section[0].palignment = true;

section2.$name                        = "Text Segments";
section2.load_memory                  = "MSRAM_0_0";
section2.output_section.create(5);
section2.output_section[0].$name      = ".text.hwi";
section2.output_section[0].palignment = true;
section2.output_section[1].$name      = ".text.cache";
section2.output_section[1].palignment = true;
section2.output_section[2].$name      = ".text.mpu";
section2.output_section[2].palignment = true;
section2.output_section[3].$name      = ".text.boot";
section2.output_section[3].palignment = true;
section2.output_section[4].$name      = ".text:abort";
section2.output_section[4].palignment = true;

